const corrects_sab =[["1"],["1"],["1"],["1"],["1"],["1"],["1"],["1"],["1"],["1"],["1"],["1"]];
const corrects = [
    ["バッタ","キリギリス","ばった","10"],
    ["17","NO17"],
    ["野原","のはら"],
    ["スピード","SPEED","ＳＰＥＥＤ"],
    ["箱入り娘","箱入娘","ハコ入り娘","ハコ入りむすめ","箱入りむすめ"],
    ["中二病","厨二病"],
    ["ぞう","ゾウ","象"],
    ["みみ","耳","ミミ"],
    ["ゴリラ","ごりら"],
    ["白","しろ","シロ"],
    ["JAYDEN","ＪＡＹＤＥＮ"],
    ["うし","牛"]
];
//ヒント
const tipsTexts = [
    "草むらにいるよ","ライオンを英語で書くと",
    "〇〇〇しんのすけ","安全運転を心掛けて",
    "箱の中に娘がいるよ","中学校2年生でかかる病気",
    "文字の中にいるよ","〇〇カク",
    "いつも言ってるでしょ","漢字を思い浮かべて",
    "ハーモニーキッズの友達","文字の中にいるよ",
];
//テキスト考える
const hideSpaces = [
    "冷たい箱で$“甘い宝”が眠る$場所",
    "ヤクルト専用の$すみか",
    "玄関にある$四角い黒い番人",
    "ジュリ専用の席、$その裏を調べよ",
    "たぷ。",
    "眠る赤い靴を調べよ",
    "３階の眠りの城$その下に眠ると$見えてくる",
    "調理と戦う$丸い鉄の勇者達が$眠る場所",
    "別世界を見せる$「ゴーグル」の下",
    "トイレに眠る$白い巻物を探せ",
    "全問正解....",
    "その糸たちは$素敵な音を奏でる"
]; 
//順番確認
const hideSpaceOrders = [1,7,11,8,6,4,12,9,10,3,5,12,2];
const openingTexts = [
    "挑戦者求ム",
    "そのお宝はまだ$誰も知らない....",
    "それは$ヨナハアパートの秘宝",
    "この家のどこかに$眠っている...",
    "だがお宝は$12個の謎で$守られている",
    "家族で$力を合わせて12個の謎を$解き明かせ",
    "制限時間は、30分",
    "さあ、家族よ......$探検を始めよう。"
];

const clearTexts = [
    "まずは――全問正解、$おめでとう。",
    "これまでかかった時間は、$hour分minutes秒。",
    "秘宝は、もう目の前まで$訪れている。",
    "だが終わりではない。$最後の試練が待つ。",
    "残り時間は$rest_hour分rest_minutes秒。",
    "皆で力を合わせ、$勝ち取るのだ。",
    "――“鍵”――そして$最後の謎の在処を示そう。", 
    "さあ、宝はもうすぐだ。$まずはこの地図を開け。",  
];

const persons = [3,1,2,0,1,2,1,0,3,2,3,3];
const personName = ["ウララ","リズ","ジョウ","ジュリ"]; 